-- MySQL dump 10.13  Distrib 5.7.25, for Linux (x86_64)
--
-- Host: localhost    Database: bsdq_db
-- ------------------------------------------------------
-- Server version	5.7.25-0ubuntu0.16.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `daqui_books`
--

DROP TABLE IF EXISTS `daqui_books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `daqui_books` (
  `shelfno` int(11) NOT NULL,
  `floorno` int(11) NOT NULL,
  `bookno` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(200) NOT NULL,
  `author` varchar(70) DEFAULT NULL,
  `label` varchar(200) DEFAULT NULL,
  `borrowed` char(1) DEFAULT '0',
  `on_reading` char(1) DEFAULT '0',
  `cleaned` char(1) DEFAULT '0',
  `encoding_time` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`bookno`)
) ENGINE=InnoDB AUTO_INCREMENT=135 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `daqui_books`
--

LOCK TABLES `daqui_books` WRITE;
/*!40000 ALTER TABLE `daqui_books` DISABLE KEYS */;
INSERT INTO `daqui_books` VALUES (13,17,1,'小花生奇遇记','花生王子','快乐的源泉,生活的意义','0','0','0','19-02-21 10h'),(2,18,2,'红楼梦','曹雪芹','经典,爱情,古代小说,红学,事态炎凉','0','0','0','20190131'),(1,17,3,'山海经','','aaaaaaaaaaaaaaaaaa,bbbbbbbbbbbbbbbbbb,cccccccccccccccccc,dddddddddddddddddd,eeeeeeeeeeeeeeeeee,ffffffffffffffffff,gggggggggggggggggg','0','0','0','20190130'),(13,33,4,'小小萝莉种菜','卢古月','种菜秘籍,科学','0','0','0','19-02-23 11h'),(2,18,5,'苏菲的世界','贾斯克','哲学启蒙,经典图书,儿童丛书,枕边书,天使入门','0','0','0','20190131'),(2,18,6,'苏菲的世界','贾斯克','哲学,经典,儿童读物','0','0','0','20190131'),(2,18,7,'红楼梦','曹雪芹','经典,爱情,古代小说,红学,事态炎凉','0','0','0','20190131'),(13,33,8,'故事新编','笑话生长','春爷们,罗利空,真的好看哦','0','0','0','19-02-21 11h'),(13,17,9,'美丽的少女','笑话','中罗写,爱上地方是,啊上帝哦','0','0','0','19-02-21 11h'),(1,17,10,'山海经','','古代,中国神话,文言文','0','0','0','20190130'),(1,17,11,'古兰经','穆罕默德','伊斯兰教,经典,圣经','1','0','0','20190131'),(2,12,12,'梦的解析','弗洛伊德','心理学','0','0','0','20190127'),(2,12,13,'水浒传','吴冠中','古代小说, 替天行道','1','0','0','20190127'),(2,12,14,'一只红狐狸','拉里','童话,寓言故事,爱心','0','0','0','20190127'),(2,21,15,'赵式孤儿','赵','心理学,古代','0','0','0','20190127'),(2,21,16,'钱不是万能的','钱','心理学,成功学','0','0','0','20190127'),(8,17,17,'史记','司马迁','史家经典, 古籍, 政治历史','0','0','0','20190202晚'),(2,22,18,'李白诗精选','李白','文学,诗歌','0','0','0','20190127'),(2,22,19,'周公解梦','周公','迷信,帐眼法','0','0','0','20190127'),(2,32,20,'吴传','吴','军事著作','0','0','0','20190127'),(2,32,21,'郑成功传','吕国庆','名人自传','0','0','0','20190127'),(2,32,22,'王的庆宴','王子','小说, 歌功颂德','0','0','0','20190127'),(7,17,23,'史记','司马迁','史家经典, 古籍, 政治历史','0','0','0','20190202晚'),(3,49,24,'撒哈啦的故事','三毛','流浪文学, 自由生活','0','0','0','20190204下午'),(3,33,25,'三毛流浪记','张乐平','国产漫画,穷苦生后,儿童,希望','1','0','0','20190203早'),(2,12,26,'梦的解析1','弗洛伊德','心理学','0','0','0','20190127'),(2,12,27,'梦的解析2','弗洛伊德','心理学','0','0','0','20190127'),(2,12,28,'梦的解析3','弗洛伊德','心理学','0','0','0','20190127'),(2,12,29,'梦的解析4','弗洛伊德','心理学','0','0','0','20190127'),(2,12,30,'梦的解析5','弗洛伊德','心理学','0','0','0','20190127'),(2,12,31,'梦的解析6','弗洛伊德','心理学','0','0','0','20190127'),(2,12,32,'梦的解析7','弗洛伊德','心理学','0','0','0','20190127'),(2,12,33,'梦的解析8','弗洛伊德','心理学','0','0','0','20190127'),(2,12,34,'梦的解析9','弗洛伊德','心理学','0','0','0','20190127'),(2,12,35,'梦的解析A','弗洛伊德','心理学','0','0','0','20190127'),(2,12,36,'水浒传1','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,37,'水浒传2','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,38,'水浒传3','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,39,'水浒传4','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,40,'水浒传5','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,41,'水浒传6','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,42,'水浒传7','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,43,'水浒传8','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,44,'水浒传9','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,45,'水浒传A','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,46,'水浒传B','吴冠中','古代小说, 替天行道','0','0','0','20190127'),(2,12,47,'一只红狐狸1','拉里','童话,寓言故事,爱心','0','0','0','20190127'),(13,17,48,'小草丽丽','丽丽','撒地方,是的附近偶尔,撒娇地方,阿斯顿佛iu,是的哦,撒的佛ie,哦你越来越','0','1','0','19-02-21 11h'),(2,12,49,'一只红狐狸3','拉里','童话,寓言故事,爱心','0','0','0','20190127'),(13,17,50,'巧克力崽子','小巧','美好的故事,真心好吃,尿布湿','0','0','0','19-02-21 11h'),(13,17,51,'小兰崽子吃好吃的被他妈妈发现了一顿挨说你说他怎么这么好吃呀','小兰','好吃的','0','0','0','19-02-21 11h'),(2,12,52,'一只红狐狸6','拉里','童话,寓言故事,爱心','0','0','0','20190127'),(2,12,53,'一只红狐狸7','拉里','童话,寓言故事,爱心','0','0','0','20190127'),(2,12,54,'一只红狐狸8','拉里','童话,寓言故事,爱心','0','0','0','20190127'),(13,17,55,'笑笑胡','狐狸花','美化话','0','0','0','19-02-21 11h'),(2,12,56,'一只红狐狸A','拉里','童话,寓言故事,爱心','0','0','0','20190127'),(2,21,57,'赵式孤儿1','赵','心理学,古代','0','0','0','20190127'),(2,21,58,'赵式孤儿2','赵','心理学,古代','0','0','0','20190127'),(2,21,59,'赵式孤儿3','赵','心理学,古代','0','0','0','20190127'),(2,21,60,'赵式孤儿4','赵','心理学,古代','0','0','0','20190127'),(2,21,61,'赵式孤儿5','赵','心理学,古代','0','0','0','20190127'),(2,21,62,'赵式孤儿6','赵','心理学,古代','0','0','0','20190127'),(2,21,63,'赵式孤儿7','赵','心理学,古代','0','0','0','20190127'),(2,21,64,'赵式孤儿8','赵','心理学,古代','0','0','0','20190127'),(2,21,65,'赵式孤儿9','赵','心理学,古代','0','0','0','20190127'),(2,21,66,'赵式孤儿A','赵','心理学,古代','0','0','0','20190127'),(2,21,67,'钱不是万能的1','钱','心理学,成功学','0','0','0','20190127'),(2,21,68,'钱不是万能的2','钱','心理学,成功学','0','0','0','20190127'),(2,21,69,'钱不是万能的3','钱','心理学,成功学','0','0','0','20190127'),(2,21,70,'钱不是万能的4','钱','心理学,成功学','0','0','0','20190127'),(2,21,71,'钱不是万能的5','钱','心理学,成功学','0','0','0','20190127'),(2,21,72,'钱不是万能的6','钱','心理学,成功学','0','0','0','20190127'),(2,21,73,'钱不是万能的7','钱','心理学,成功学','0','0','0','20190127'),(2,21,74,'钱不是万能的8','钱','心理学,成功学','0','0','0','20190127'),(2,21,75,'钱不是万能的9','钱','心理学,成功学','0','0','0','20190127'),(2,21,76,'钱不是万能的A','钱','心理学,成功学','0','0','0','20190127'),(2,21,77,'孙子兵法1','孙','心理学,军事经典,战术','1','0','0','20190127'),(2,21,78,'孙子兵法2','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,79,'孙子兵法3','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,80,'孙子兵法4','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,81,'孙子兵法5','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,82,'孙子兵法6','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,83,'孙子兵法7','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,84,'孙子兵法8','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,85,'孙子兵法9','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,86,'孙子兵法A','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,21,87,'孙子兵法B','孙','心理学,军事经典,战术','0','0','0','20190127'),(2,22,88,'李白诗精选1','李白','文学,诗歌','0','0','0','20190127'),(2,22,89,'李白诗精选2','李白','文学,诗歌','0','0','0','20190127'),(2,22,90,'李白诗精选3','李白','文学,诗歌','0','0','0','20190127'),(2,22,91,'李白诗精选4','李白','文学,诗歌','0','0','0','20190127'),(2,22,92,'李白诗精选5','李白','文学,诗歌','0','0','0','20190127'),(2,22,93,'李白诗精选6','李白','文学,诗歌','0','0','0','20190127'),(2,22,94,'李白诗精选7','李白','文学,诗歌','0','0','0','20190127'),(2,22,95,'李白诗精选8','李白','文学,诗歌','0','0','0','20190127'),(2,22,96,'李白诗精选9','李白','文学,诗歌','0','0','0','20190127'),(2,22,97,'李白诗精选A','李白','文学,诗歌','0','0','0','20190127'),(2,32,98,'吴传1','吴','军事著作','0','0','0','20190127'),(2,32,99,'吴传2','吴','军事著作','0','0','0','20190127'),(2,32,100,'吴传3','吴','军事著作','0','0','0','20190127'),(2,32,101,'吴传4','吴','军事著作','0','0','0','20190127'),(2,32,102,'吴传5','吴','军事著作','0','0','0','20190127'),(2,32,103,'吴传6','吴','军事著作','0','0','0','20190127'),(2,32,104,'吴传7','吴','军事著作','0','0','0','20190127'),(2,32,105,'吴传8','吴','军事著作','0','0','0','20190127'),(2,32,106,'吴传9','吴','军事著作','0','0','0','20190127'),(2,32,107,'吴传A','吴','军事著作','0','0','0','20190127'),(2,32,108,'吴传B','吴','军事著作','0','0','0','20190127'),(2,32,109,'郑成功传1','吕国庆','名人自传','0','0','0','20190127'),(2,32,110,'郑成功传2','吕国庆','名人自传','0','0','0','20190127'),(2,32,111,'郑成功传3','吕国庆','名人自传','0','0','0','20190127'),(2,32,112,'郑成功传4','吕国庆','名人自传','0','0','0','20190127'),(2,32,113,'郑成功传5','吕国庆','名人自传','0','0','0','20190127'),(2,32,114,'郑成功传6','吕国庆','名人自传','0','0','0','20190127'),(2,32,115,'郑成功传7','吕国庆','成功学著作,人生导师','0','0','0','20190127'),(2,32,116,'郑成功传8','吕国庆','名人自传','0','0','0','20190127'),(2,32,117,'郑成功传9','吕国庆','名人自传','0','0','0','20190127'),(2,32,118,'郑成功传A','吕国庆','名人自传','0','0','0','20190127'),(2,32,119,'郑成功传B','吕国庆','名人自传','0','0','0','20190127'),(2,32,120,'王的庆宴1','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,121,'王的庆宴2','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,122,'王的庆宴3','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,123,'王的庆宴4','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,124,'王的庆宴5','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,125,'王的庆宴6','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,126,'王的庆宴7','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,127,'王的庆宴8','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,128,'王的庆宴9','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,129,'王的庆宴A','王子','小说, 歌功颂德','0','0','0','20190127'),(2,32,130,'王的庆宴B','王子','小说, 歌功颂德','0','0','0','20190127'),(2,34,131,'舌尖上的中国','陈晓卿','美味,故乡的味道,经典解说词,风味人间','0','0','0','19-02-21 08h'),(9,34,132,'aaaaaaaaaaaaaaaaaaaaaafffffffffffffffff','asdf    sadfsd??ersseraaaaaaa','','0','0','2','19-02-23 19h'),(2,34,133,'新概念英语3','何其莘','英语学习,口语练习,经典教材','0','0','0','19-02-26 21h'),(2,17,134,'ssdf','asdf','美丽少鸟,英语万岁,我爱学习哦,爱上地方,真的爱你','0','0','0','19-02-26 21h');
/*!40000 ALTER TABLE `daqui_books` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-02-27 14:27:10
